CanBeHidden Method
Indicates if the element can be hidden in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool CanBeHidden(
	View pView
)
Visual Basic
Public Function CanBeHidden ( _
	pView As View _
) As Boolean
Visual C++
public:
bool CanBeHidden(
	View^ pView
)
Parameters
pView
Type: Autodesk.Revit.DBView
Return Value
If the element is not permitted to be hidden, false is returned.
Remarks
 See discussion for some types of elements which may not be hidden. Note: elements in families can only be hidden temporarily.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException | Thrown when argument is a null reference (Nothing in Visual Basic).
See Also
Element Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →